# Работа с БД chinook на SQLite

- https://www.sqlitetutorial.net/sqlite-sample-database/
- https://www.sqlitetutorial.net/wp-content/uploads/2018/03/chinook.zip
- https://www.sqlitetutorial.net/wp-content/uploads/2015/11/sqlite-sample-database-color.jpg

In [1]:
import sqlite3
from prettytable import from_db_cursor

In [2]:
db_name = "chinook.db"

In [3]:
db = sqlite3.connect(db_name)
cur = db.cursor()

In [4]:
cur.execute("SELECT name FROM sqlite_master WHERE type = 'table'")
from_db_cursor(cur)

+-----------------+
|       name      |
+-----------------+
|      albums     |
| sqlite_sequence |
|     artists     |
|    customers    |
|    employees    |
|      genres     |
|     invoices    |
|  invoice_items  |
|   media_types   |
|    playlists    |
|  playlist_track |
|      tracks     |
|   sqlite_stat1  |
+-----------------+

In [5]:
cur.execute("PRAGMA table_info('customers')")
from_db_cursor(cur)

+-----+--------------+--------------+---------+------------+----+
| cid |     name     |     type     | notnull | dflt_value | pk |
+-----+--------------+--------------+---------+------------+----+
|  0  |  CustomerId  |   INTEGER    |    1    |    None    | 1  |
|  1  |  FirstName   | NVARCHAR(40) |    1    |    None    | 0  |
|  2  |   LastName   | NVARCHAR(20) |    1    |    None    | 0  |
|  3  |   Company    | NVARCHAR(80) |    0    |    None    | 0  |
|  4  |   Address    | NVARCHAR(70) |    0    |    None    | 0  |
|  5  |     City     | NVARCHAR(40) |    0    |    None    | 0  |
|  6  |    State     | NVARCHAR(40) |    0    |    None    | 0  |
|  7  |   Country    | NVARCHAR(40) |    0    |    None    | 0  |
|  8  |  PostalCode  | NVARCHAR(10) |    0    |    None    | 0  |
|  9  |    Phone     | NVARCHAR(24) |    0    |    None    | 0  |
|  10 |     Fax      | NVARCHAR(24) |    0    |    None    | 0  |
|  11 |    Email     | NVARCHAR(60) |    1    |    None    | 0  |
|  12 | SupportRepId |   INTEGER    |    0    |    None    | 0  |
+-----+--------------+--------------+---------+------------+----+

In [7]:
cur.execute("SELECT CustomerId, LastName, City FROM customers")
print(cur.fetchone())
print(cur.fetchone())

(1, 'Gonçalves', 'São José dos Campos')
(2, 'Köhler', 'Stuttgart')

In [9]:
# .fetchone() - извлекает следующую строку из набора результата запросв в БД
cur.execute("SELECT CustomerId, LastName, City FROM customers").fetchone()

(1, 'Gonçalves', 'São José dos Campos')

In [10]:
# .fetchone() - извлеxtn ВСЕ оставшиеся строки из набора результата запросв в БД
cur.execute("SELECT CustomerId, LastName, City FROM customers").fetchall()

[(1, 'Gonçalves', 'São José dos Campos'),
 (2, 'Köhler', 'Stuttgart'),
 (3, 'Tremblay', 'Montréal'),
 (4, 'Hansen', 'Oslo'),
 (5, 'Wichterlová', 'Prague'),
 (6, 'Holý', 'Prague'),
 (7, 'Gruber', 'Vienne'),
 (8, 'Peeters', 'Brussels'),
 (9, 'Nielsen', 'Copenhagen'),
 (10, 'Martins', 'São Paulo'),
 (11, 'Rocha', 'São Paulo'),
 (12, 'Almeida', 'Rio de Janeiro'),
 (13, 'Ramos', 'Brasília'),
 (14, 'Philips', 'Edmonton'),
 (15, 'Peterson', 'Vancouver'),
 (16, 'Harris', 'Mountain View'),
 (17, 'Smith', 'Redmond'),
 (18, 'Brooks', 'New York'),
 (19, 'Goyer', 'Cupertino'),
 (20, 'Miller', 'Mountain View'),
 (21, 'Chase', 'Reno'),
 (22, 'Leacock', 'Orlando'),
 (23, 'Gordon', 'Boston'),
 (24, 'Ralston', 'Chicago'),
 (25, 'Stevens', 'Madison'),
 (26, 'Cunningham', 'Fort Worth'),
 (27, 'Gray', 'Tucson'),
 (28, 'Barnett', 'Salt Lake City'),
 (29, 'Brown', 'Toronto'),
 (30, 'Francis', 'Ottawa'),
 (31, 'Silk', 'Halifax'),
 (32, 'Mitchell', 'Winnipeg'),
 (33, 'Sullivan', 'Yellowknife'),
 (34, 'Fernandes', 'Lisbon'),
 (35, 'Sampaio', 'Porto'),
 (36, 'Schneider', 'Berlin'),
 (37, 'Zimmermann', 'Frankfurt'),
 (38, 'Schröder', 'Berlin'),
 (39, 'Bernard', 'Paris'),
 (40, 'Lefebvre', 'Paris'),
 (41, 'Dubois', 'Lyon'),
 (42, 'Girard', 'Bordeaux'),
 (43, 'Mercier', 'Dijon'),
 (44, 'Hämäläinen', 'Helsinki'),
 (45, 'Kovács', 'Budapest'),
 (46, "O'Reilly", 'Dublin'),
 (47, 'Mancini', 'Rome'),
 (48, 'Van der Berg', 'Amsterdam'),
 (49, 'Wójcik', 'Warsaw'),
 (50, 'Muñoz', 'Madrid'),
 (51, 'Johansson', 'Stockholm'),
 (52, 'Jones', 'London'),
 (53, 'Hughes', 'London'),
 (54, 'Murray', 'Edinburgh '),
 (55, 'Taylor', 'Sidney'),
 (56, 'Gutiérrez', 'Buenos Aires'),
 (57, 'Rojas', 'Santiago'),
 (58, 'Pareek', 'Delhi'),
 (59, 'Srivastava', 'Bangalore')]

In [11]:

cur.execute("SELECT CustomerId, LastName, City FROM customers").fetchall()[0:4]

[(1, 'Gonçalves', 'São José dos Campos'),
 (2, 'Köhler', 'Stuttgart'),
 (3, 'Tremblay', 'Montréal'),
 (4, 'Hansen', 'Oslo')]

In [12]:

cur.execute("SELECT CustomerId, LastName, City FROM customers").fetchmany(size = 4)

[(1, 'Gonçalves', 'São José dos Campos'),
 (2, 'Köhler', 'Stuttgart'),
 (3, 'Tremblay', 'Montréal'),
 (4, 'Hansen', 'Oslo')]

In [13]:

cur.execute("SELECT CustomerId, LastName, City FROM customers LIMIT 4").fetchall()

[(1, 'Gonçalves', 'São José dos Campos'),
 (2, 'Köhler', 'Stuttgart'),
 (3, 'Tremblay', 'Montréal'),
 (4, 'Hansen', 'Oslo')]

In [14]:

cur.execute("SELECT CustomerId, LastName, City FROM customers LIMIT 4")
t = from_db_cursor(cur)
t

+------------+-----------+---------------------+
| CustomerId |  LastName |         City        |
+------------+-----------+---------------------+
|     1      | Gonçalves | São José dos Campos |
|     2      |   Köhler  |      Stuttgart      |
|     3      |  Tremblay |       Montréal      |
|     4      |   Hansen  |         Oslo        |
+------------+-----------+---------------------+

In [16]:
t[0:2]

+------------+-----------+---------------------+
| CustomerId |  LastName |         City        |
+------------+-----------+---------------------+
|     1      | Gonçalves | São José dos Campos |
|     2      |   Köhler  |      Stuttgart      |
+------------+-----------+---------------------+

In [17]:
cur.description

(('CustomerId', None, None, None, None, None, None),
 ('LastName', None, None, None, None, None, None),
 ('City', None, None, None, None, None, None))